<?php
return [
    //站点
    'siteType' => [
        '' => '请选择',
        '1' => 'Zeelool',
        '2' => 'Voogueme',
        '3' => 'Nihao',
        '4' => 'Wesee',
        '5' => 'Other',
        '6' => '如弗小程序',
    ],
    //抄送人
    'copyToUserId' => [
        '' => '------ 请选择 ------',
        '52' => 'W王帅鹏',
        '49' => 'C陈见',
        'Z' => '------ Z站 ------',
        '53' => 'W吴方',
        '54' => 'W王小花',
        '73' => 'P彭梦婷',
        '80' => 'X谢梦飞',
        'V' => '------ V站 ------',
        '51' => 'L刘明明',
        '79' => 'L李裕祺',
        '78' => 'Z朱美洁',
        '122' => 'S史琛璐',
        'N' => '------ 你好站 ------',
        '65' => 'C陈彩丽',
        '55' => 'L李衡',
        'W' => '------ 批发站 ------',
        '102' => 'Z朱彩霞',
        'IT' => '------ 技术 ------',
        '148' => 'Z张晓',
        '181' => 'L李想',
        '191' => 'H黄彬彬',
        '185' => 'C陈奕仁',
        '195' => 'M马红亚',
        '200' => 'C陈亚蒙',
        '194' => 'Y杨志豪',
        'KF' => '------ 客服 ------',
        '75' => 'W王伟',
        '95' => 'B白青青',
        '117' => 'H韩雨薇',
    ],
    //整体复杂度
    'allComplexity' => [
        '1' => '简单',
        '2' => '中等',
        '3' => '复杂',
    ],

    //是否需要测试
    'testGroup' => [
        '1' => '需要',
        '2' => '不需要',
    ],
    //前端组员
    'web_designer_user' => [
        '' => '------ 请选择 ------',
        '185' => '陈奕任',
        '186' => '李扬',
        '188' => '李蓓',
        '190' => '刘雨东',
        '281' => '杨满花',

    ],
    //后端组员
    'phper_user' => [
        '' => '------ 请选择 ------',
        '191' => '黄彬彬',
        '192' => '卢志恒',
        '204' => '王恒刚',
        '229' => '周正晖',
        '227' => '刘松巍',

    ],
    //app组员
    'app_user' => [
        '' => '------ 请选择 ------',
        '194' => '杨志豪',
    ],
    //测试组员
    'test_user' => [
        '' => '------ 请选择 ------',
        '195' => '马红亚',
        '200' => '陈亚蒙',
        '202' => '贾梦丽',
        '242' => '张鹏',
        '255' => '陈玉晓'
    ],
    

    //测试bug严重类型
    'bug_type' => [
        '1' => '次要',
        '2' => '一般',
        '3' => '严重',
        '4' => '崩溃',
    ],
    //类型 lsw add
    'demand_type' =>[
        1=> 'bug',
        2=> '需求',
        3=> '疑难',
    ]


];