<?php
return [
    //站点
    'siteType' => [
        '' => '请选择',
        '1' => 'Zeelool',
        '2' => 'Voogueme',
        '3' => 'Nihao',
        '4' => 'Wesee',
        '5' => '魔晶',
        '6' => 'Orther',
    ],
    //抄送人
    'copyToUserId' => [
        '' => '------ 请选择 ------',
        '980' => 'W王帅鹏',
        '971' => 'C陈见',
        'Z' => '------ Z站 ------',
        '990' => 'W吴方',
        '993' => 'W王小花',
        '992' => 'P彭梦婷',
        '991' => 'X谢梦飞',
        '983' => 'W王朝霞',
        '977' => 'S孙敏',
        'V' => '------ V站 ------',
        '984' => 'L刘明明',
        '986' => 'L李裕祺',
        '988' => 'Z朱美洁',
        '982' => 'L刘露',
        '978' => 'S史琛璐',
        '975' => 'D董圆圆',
        'N' => '------ 你好站 ------',
        '994' => 'C陈彩丽',
        '985' => 'L李衡',
        'W' => '------ 批发站 ------',
        '973' => 'Z朱彩霞',
        'IT' => '------ 技术 ------',
        '999' => 'Z张晓',
        '997' => 'L李想',
        '996' => 'M苗晶晶',
        '995' => 'C陈奕仁',
        '976' => 'M马红亚',
        '974' => 'L李红鑫',
        '972' => 'Y杨志豪',
        'KF' => '------ 客服 ------',
        '981' => 'W王伟',
        '989' => 'B白青青',
        '979' => 'H韩雨薇',
    ],
    //整体复杂度
    'allComplexity' => [
        '1' => '简单',
        '2' => '中等',
        '3' => '复杂',
    ],

    //是否需要测试
    'testGroup' => [
        '1' => '需要',
        '2' => '不需要',
    ],
    //前端组员
    'web_designer_user' => [
        '' => '------ 请选择 ------',
        '970' => '李杨',
        '969' => '李蓓',
        '968' => '梁方祎',
        '995' => '陈奕仁',
    ],
    //后端组员
    'phper_user' => [
        '' => '------ 请选择 ------',
        '967' => '卢志恒',
        '996' => '苗晶晶',
    ],
    //app组员
    'app_user' => [
        '' => '------ 请选择 ------',
        '972' => '杨志豪',
    ],
    //测试组员
    'test_user' => [
        '' => '------ 请选择 ------',
        '976' => '马红亚',
        '974' => '李红鑫',
    ],
    //开发任务管理员
    'developer_user' => [
        ''
    ],


    //测试bug严重类型
    'bug_type' => [
        '1' => '次要',
        '2' => '一般',
        '3' => '严重',
        '4' => '崩溃',
    ],




];