<?php


return [
    /*
   |-----------------------------------------------------------
   | 【必填】企业 corpId
   |-----------------------------------------------------------
   */
    'corp_id' => 'ding84ad0c7e075023e935c2f4657eb6378f',

    /*
    |-----------------------------------------------------------
    | 【必填】应用 AppKey
    |-----------------------------------------------------------
    */
    'app_key' => 'dinge51fl8wubuih963a',

    /*
    |-----------------------------------------------------------
    | 【必填】应用 AppSecret
    |-----------------------------------------------------------
    */
    'app_secret' => 'qZwUg-d_aaiQY8ez0XXCfsZYI2AlH5wg9f1JtZIK4LG9832IzZp_CtW7EbYKVWfm',
    'token' => 'uhl3CZbtsmf93bFPanmMenhWwrqbSwPc',
    'aes_key' => 'qZEOmHU2qYYk6n6vqLfi3FAhcp9bGA2kgbfnsXDrGgN',
];